In [2]:
!cat small.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
df = pd.read_csv('small.csv')

In [6]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
names = ['a', 'b', 'c', 'd', 'message']

In [8]:
pd.read_csv('small.csv', names=names, index_col='message')

         a   b   c   d
message
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [9]:
!cat ../pydata-book/examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [10]:
parsed = pd.read_csv('../pydata-book/examples/csv_mindex.csv',
                     index_col=['key1', 'key2'])

In [11]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [12]:
parsed['value1']

key1  key2
one   a        1
      b        3
      c        5
      d        7
two   a        9
      b       11
      c       13
      d       15
Name: value1, dtype: int64

In [13]:
list(open('../pydata-book/examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [14]:
result = pd.read_csv('../pydata-book/examples/ex3.txt', sep='\s+')

In [15]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [16]:
!cat ../pydata-book/examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [17]:
#for when there's a bunch of garbage in the data file:
#we then use skiprows and a list of row indexes
pd.read_csv('../pydata-book/examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
!cat ../pydata-book/examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [19]:
result = pd.read_csv('../pydata-book/examples/ex5.csv')

In [20]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [21]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [22]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [22]:
pd.read_csv('../pydata-book/examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [23]:
result = pd.read_csv('../pydata-book/examples/ex6.csv')

In [24]:
pd.options.display.max_rows = 10

In [25]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [26]:
chunker = pd.read_csv('../pydata-book/examples/ex6.csv', chunksize=1000)

In [27]:
tot = pd.Series([])

In [28]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

In [29]:
tot = tot.sort_values(ascending=False)

In [30]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [33]:
tot.sort_index()

0    151.0
1    146.0
2    152.0
3    162.0
4    171.0
     ...
V    328.0
W    305.0
X    364.0
Y    314.0
Z    288.0
Length: 36, dtype: float64

In [34]:
data = pd.read_csv('../pydata-book/examples/ex5.csv')

In [35]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [36]:
data.to_csv('../pydata-book/examples/out.csv')

In [37]:
!cat ../pydata-book/examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [39]:
import sys

In [40]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [41]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [42]:
dates = pd.date_range('1/1/2000', periods=10)

In [43]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08',
               '2000-01-09', '2000-01-10'],
              dtype='datetime64[ns]', freq='D')

In [44]:
ts = pd.Series(np.arange(10), index=dates)

In [45]:
ts.to_csv('../pydata-book/examples/tseries.csv')

/home/aaron/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [46]:
#working with delimited formats:

In [47]:
!cat ../pydata-book/examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [48]:
f = open('../pydata-book/examples/ex7.csv')

In [50]:
import csv

In [51]:
reader = csv.reader(f)

In [52]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [4]:
!cat ../pydata-book/examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [8]:
import csv

In [10]:
with open('../pydata-book/examples/ex7.csv', 'r') as f:
    lines = list(csv.reader(f))

In [11]:
header, values = lines[0], lines[1:]

In [12]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [13]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [15]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [16]:
reader = csv.reader(f, dialect=my_dialect)

TypeError: argument 1 must be an iterator

In [17]:
reader = csv.reader(f, delimiter='|')

TypeError: argument 1 must be an iterator

In [20]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow('one two three'.split())
    writer.writerow('1 2 3'.split())
    writer.writerow('4 5 6'.split())
    writer.writerow('7 8 9'.split())

In [22]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"Name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [23]:
import json

In [24]:
result = json.loads(obj)

In [25]:
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'Name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [26]:
asjson = json.dumps(result)

In [27]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"Name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [1]:
import pandas as pd

In [30]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [31]:
#press l in command mode in jupyter notebooks to toggle line numbers

In [32]:
siblings

    name  age
0    NaN   30
1  Katie   38

In [33]:
!cat ../pydata-book/examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [35]:
data = pd.read_json('../pydata-book/examples/example.json')

In [36]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [38]:
#json doesn't like trailing commas in lists

In [37]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [2]:
tables = pd.read_html('../pydata-book/examples/fdic_failed_bank_list.html')

In [3]:
len(tables)

1

In [5]:
failures = tables[0]

In [6]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [7]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [8]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

In [14]:
!ls -R ../pydata-book/ | grep mta

mta_perf
../pydata-book/datasets/mta_perf:

In [9]:
from lxml import objectify

In [16]:
path = '../pydata-book/datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [17]:
data = []

In [18]:
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

In [20]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [21]:
root.INDICATOR

In [22]:
perf = pd.DataFrame(data)

In [23]:
perf.head()

,AGENCY_NAME,CATEGORY,DESCRIPTION,FREQUENCY,INDICATOR_NAME,INDICATOR_UNIT,MONTHLY_ACTUAL,MONTHLY_TARGET,PERIOD_MONTH,PERIOD_YEAR,YTD_ACTUAL,YTD_TARGET
0,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,1,2008,96.9,95
1,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95,95,2,2008,96,95
2,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,3,2008,96.3,95
3,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,98.3,95,4,2008,96.8,95
4,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95.8,95,5,2008,96.6,95

In [24]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [25]:
root

In [26]:
root.get('href')

'http://www.google.com'

In [27]:
root.text

'Google'

In [29]:
frame = pd.read_csv('../pydata-book/examples/ex1.csv')

In [30]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [31]:
frame.to_pickle('../pydata-book/examples/frame_pickle')

In [32]:
pd.read_pickle('../pydata-book/examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [34]:
import numpy as np

In [35]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [36]:
store = pd.HDFStore('mydata.h5')

In [37]:
store['obj1'] = frame

In [38]:
store['obj1_col'] = frame['a']

In [39]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [41]:
!cat mydata.h5

In [42]:
#Skipped over HDF5 section...

In [43]:
xlsx = pd.ExcelFile('../pydata-book/examples/ex1.xlsx')

In [44]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [47]:
writer = pd.ExcelWriter('../pydata-book/ex2.xlsx')

In [48]:
frame.to_excel(writer, 'Sheet1')

In [49]:
writer.save()

In [50]:
frame.to_excel('../pydata-book/examples/ex2.xlsx')

In [51]:
import requests

In [52]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [53]:
resp = requests.get(url)

In [54]:
resp

In [55]:
data = resp.json()

In [56]:
data[0]['title']

'DEPS: Using cpplint from conda-forge'

In [57]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])

In [58]:
issues

,number,title,labels,state
0,26693,DEPS: Using cpplint from conda-forge,"[{'id': 527603109, 'node_id': 'MDU6TGFiZWw1Mjc...",open
1,26692,If tuples used as index pd.read_json( orient='...,[],open
2,26690,ImportError: cannot import name 'Timedelta',[],open
3,26689,Comparison between TimedeltaIndex/PeriodIndex ...,"[{'id': 47223669, 'node_id': 'MDU6TGFiZWw0NzIy...",open
4,26688,series.rolling doesn't create windows when val...,[],open
5,26687,rolling_apply forces output type to be numerical,[],open
6,26686,Defer Series.str.get_dummies to pandas.get_dum...,[],open
7,26685,Issue 23868 import errors,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
8,26684,Deprecate Series/Dataframe.to_dense/to_sparse,[],open
9,26683,Warning while reindexing tz aware index with m...,"[{'id': 211840, 'node_id': 'MDU6TGFiZWwyMTE4ND...",open
10,26679,DOC: Fixed warning about convert_objects in do...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
11,26678,TST: avoid matplotlib warnings in tests,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
12,26677,BUG: .isin on datetimelike indexes do not vali...,"[{'id': 1218227310, 'node_id': 'MDU6TGFiZWwxMj...",open
13,26676,VIS: test plots losing information on y axis,[],open
14,26675,BUG: .isin on datetimelike indexes do not vali...,"[{'id': 1218227310, 'node_id': 'MDU6TGFiZWwxMj...",open
15,26673,TST: tests.plotting.test_frame.test_subplots f...,[],open
16,26671,WIP: isort init files,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
17,26670,WIP: environment.yml encounters import error w...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
18,26667,pandas cannot actually read Stata file format 104,"[{'id': 104865385, 'node_id': 'MDU6TGFiZWwxMDQ...",open
19,26666,PERF: use lazy imports on py37 to speed up import,[],open
20,26663,PERF: asv for import time,"[{'id': 732775912, 'node_id': 'MDU6TGFiZWw3MzI...",open
21,26662,Excel Tests Continued Fixture Cleanup,"[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open
22,26661,CI: Remove isort from CI dependencies,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
23,26660,Indices of df.describe(percentiles=np.linspace...,"[{'id': 47223669, 'node_id': 'MDU6TGFiZWw0NzIy...",open
24,26658,loc allows different length boolean indexer,"[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
25,26656,CI/DOC: pyarrow ImportError when using environ...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
26,26652,Allow operator overloading for custom classes ...,[],open
27,26651,"BUG: avoid overflow in Bday generate_range, cl...","[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
28,26650,Handle numpy.matmul in DataFrame.__array_ufunc__,[],open
29,26649,"merge_asof with one tz-aware datetime ""by"" par...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open

In [59]:
import sqlite3

In [66]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""

In [67]:
con = sqlite3.connect('mydata.sqlite')

In [68]:
con.execute(query)

In [69]:
con.commit()

In [70]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [71]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [72]:
con.executemany(stmt, data)

In [73]:
con.commit()

In [74]:
cursor = con.execute('select * from test')

In [75]:
rows = cursor.fetchall()

In [76]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [77]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [78]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [79]:
import sqlalchemy as sqla

In [80]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [81]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5